; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=3, packages=2, locations=7, density=0.7142857142857143, fully_connected=False, max_capacity=2, out_folder=./dense/training, instance_id=12, seed=53

(define (problem transport-12)
 (:domain transport)
 (:objects 
    v1 v2 v3 - vehicle
    p1 p2 - package
    l1 l2 l3 l4 l5 l6 l7 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l6)
    (at p2 l5)
    (at v1 l3)
    (at v2 l6)
    (at v3 l4)
    (road l3 l4)
    (road l6 l5)
    (road l4 l3)
    (road l3 l7)
    (road l1 l4)
    (road l7 l3)
    (road l2 l3)
    (road l5 l6)
    (road l5 l3)
    (road l3 l2)
    (road l4 l1)
    (road l3 l5)
    (road l2 l5)
    (road l5 l2)
    (road l4 l5)
    (road l5 l4)
    (road l1 l3)
    (road l3 l1)
    (road l1 l2)
    (road l2 l1)
    (road l4 l7)
    (road l7 l4)
    (road l6 l7)
    (road l7 l6)
    (road l1 l7)
    (road l7 l1)
    (road l3 l6)
    (road l6 l3)
    (road l2 l7)
    (road l7 l2)
    )
 (:goal  (and 
    (at p1 l2)
    (at p2 l1))))

; plan
1. (pick-up v2 l6 p1 c1 c2)
   deleted: (at p1 l6) (capacity v2 c2)
   added: (in p1 v2) (capacity v2 c1)
   goals met: 0 of 2
2. (drive v2 l6 l5)
   deleted: (at v2 l6)
   added: (at v2 l5)
   goals met: 0 of 2
3. (pick-up v2 l5 p2 c0 c1)
   deleted: (at p2 l5) (capacity v2 c1)
   added: (in p2 v2) (capacity v2 c0)
   goals met: 0 of 2
4. (drive v2 l5 l2)
   deleted: (at v2 l5)
   added: (at v2 l2)
   goals met: 0 of 2
5. (drop v2 l2 p1 c0 c1)
   deleted: (in p1 v2) (capacity v2 c0)
   added: (at p1 l2) (capacity v2 c1)
   goals met: 1 of 2
6. (drive v2 l2 l1)
   deleted: (at v2 l2)
   added: (at v2 l1)
   goals met: 1 of 2
7. (drop v2 l1 p2 c1 c2)
   deleted: (in p2 v2) (capacity v2 c1)
   added: (at p2 l1) (capacity v2 c2)
   goals met: 2 of 2
